from docx import Document
from docx.enum.text import WD_PARAGRAPH_ALIGNMENT

docRGR = Document()

style = docRGR.styles['Normal']
style.font.name = "Times New Roman"

# ============================================================================================
# Первая страница Первая страница Первая страница Первая страница Первая страница
# ============================================================================================

# заголовок 1
head1 = docRGR.add_heading("Резюме", 1)
# центрирую
head1.alignment = WD_PARAGRAPH_ALIGNMENT.CENTER
one = docRGR.add_paragraph("Костин Максим Михайлович. ")
one.add_run("ИСТ-101.")
docRGR.add_paragraph("Краткая карта обучения: ")

# заголовок 2
docRGR.add_heading("Учёба в колледже", 2)
one = docRGR.add_paragraph("Обучался в Брянском профессионально-педагогическом колледже. ")
one.add_run("Обучение: Студент группы ИС-17.")
docRGR.add_paragraph("Дата поступления - 2017 год. ")

# заголовок 3
docRGR.add_heading("Учёба в ВУЗЕ", 3)
one = docRGR.add_paragraph("На данный момент обучаюсь в Брянском государственном инженерно-технологическом университете. ")
one.add_run("Обучение: Студент группы ИСТ-101.")
docRGR.add_paragraph("Дата поступления - 2021 год. ")

# разрыв страницы
docRGR.add_page_break()

# ============================================================================================
# Вторая страница Вторая страница Вторая страница Вторая страница Вторая страница
# ============================================================================================

# Данные
data = (
    (1, 'Информатика', 'Экзамен', '5', '+'),
    (2, 'Математика', 'Зачёт', '4', '+'),
    (3, 'Физика', 'Зачёт', '5', '+'),
    (4, 'Физкульутра', 'Зачёт', '4', '-'),
    (5, 'Психология', 'Зачёт', '4', '-'),
    (6, 'Руcский язык', 'Зачёт', '4', '-'),
    (7, 'Философия', 'Экзамен', '5', '-'),
    (8, 'Иностранный язык', 'Экзамен', '5', '-'),
    (9, 'Алгоритмизация', 'Экзамен', '5', '-'),
    (10, 'Python', 'Зачёт', '5', '-'),
)

# таблица
table = docRGR.add_table(1, len(data[0]))
table.style = 'Medium Shading 1 Accent 2'
head_cells = table.rows[0].cells

# Добавляем названия колонок
for i, item in enumerate(['№', 'Предмет', 'Форма сдачи', 'Оценка', 'РГР']):
    p = head_cells[i].paragraphs[0]
    p.add_run(item).bold = True
    p.alignment = WD_PARAGRAPH_ALIGNMENT.CENTER

# добавляем данные к существующей таблице
for row in data:
    cells = table.add_row().cells
    for i, item in enumerate(row):
        # вставляем данные в ячейки
        cells[i].text = str(item)

# сохраняем файл
docRGR.save('Resume.docx')